//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, 
//а какое меньшее.

/*Console.WriteLine("ВВедите число а");
int a = int.Parse(Console.ReadLine());
Console.WriteLine("ВВедите число b");
int b = int.Parse(Console.ReadLine());
if (a > b) { Console.WriteLine($"max = {a}");}
else{ Console.WriteLine($"max = {b}");}*/

